ys1797/esp32_hd/main/hd_main.c
		if (CurPower<5 && Hpoint<=TRIAC_GATE_MAX_CYCLES && SetPower > 0) {
			// Отслеживание отключенной нагрузки
			cnt ++;
			if (cnt>10) AlarmMode |= ALARM_NOLOAD;
		} else {
			cnt = 0;
			AlarmMode &= ~(ALARM_NOLOAD);
		}

		if (SetPower <= 0) {
			Hpoint = HMAX;
		} else {
			// Проверка рассинхронизации мощности
			int delta = abs(SetPower - CurPower);
//			int p5 = SetPower/20;
			char inc = SetPower > CurPower;

			if (delta > 200 ) {
				if (inc) Hpoint -= 50; 
				else Hpoint += 50;
			} else if (delta > 50) {
				if (inc) Hpoint -= 10; 
				else Hpoint += 10;
			} else  if (delta > 10) {
				if (inc) Hpoint -=2; 
				else Hpoint +=2;
			} else if (delta >= 5) {
				if (inc) Hpoint --; 
				else Hpoint ++;
			}
		}
		if (SetPower > 0 && Hpoint >= (HMAX - TRIAC_GATE_MAX_CYCLES) ) {
			Hpoint = HMAX - 1 - TRIAC_GATE_MAX_CYCLES;
		}
		if (Hpoint<TRIAC_GATE_MAX_CYCLES) Hpoint=TRIAC_GATE_MAX_CYCLES;

		vTaskDelay(1000/portTICK_PERIOD_MS);
	}
}


const char *getMainModeStr(void)
{
	switch (MainMode) {
        case MODE_IDLE:	return "Монитор";
        case MODE_POWEERREG: return "Регулятор мощности";
	case MODE_DISTIL: return "Дистилляция";
	case MODE_RECTIFICATION: return "Ректификация";
	case MODE_TESTKLP: return "Тестирование клапанов";
	default: return "Неизвестно";
	}
}

const char *getMainStatusStr(void)
{
	switch (MainMode) {
        case MODE_IDLE:
	case MODE_TESTKLP:
		return "Ожидание команды";
        case MODE_POWEERREG:
		switch (MainStatus) {
		case START_WAIT: return "Ожидание запуска процесса";
		case PROC_START: return "Стабилизация мощности";
		default: return "Завершение работы";
		}
		break;
	case MODE_DISTIL:
		switch (MainStatus) {
		case START_WAIT: return "Ожидание запуска процесса";
		case PROC_START: return "Начало процесса";
		case PROC_RAZGON: return "Разгон до рабочей температуры";
		case PROC_DISTILL: return "Дистилляция";
		case PROC_WAITEND: return "Отключение нагрева, подача воды для охлаждения";
		default: return "Завершение работы";
		}
		break;
	case MODE_RECTIFICATION:
		switch (MainStatus) {
		case START_WAIT: return "Ожидание запуска процесса";
		case PROC_START: return "Начало процесса";
		case PROC_RAZGON: return "Разгон до рабочей температуры";
		case PROC_STAB: return "Стабилизация температуры";
		case PROC_GLV: return "Отбор головных фракций";
		case PROC_T_WAIT: return "Ожидание стабилизации температуры";
		case PROC_SR: return "Отбор СР";
		case PROC_HV: return "Отбор хвостовых фракций";
		case PROC_WAITEND: return "Отключение нагрева, подача воды для охлаждения";
		default: return "Завершение работы";
		}
		break;
	default:
		return "Неизвестно";
	}

}

const char *getAlarmModeStr(void)
{
	static char str[256];
	int cnt;

	if (!AlarmMode) return "<b class=\"green\">Не зафиксированo</b>";
	strcpy(str, "<b class=\"red\">");

	if (AlarmMode & ALARM_TEMP) {
		cnt = sizeof(str) - strlen(str);
		strncat(str, "Превышение температуры", cnt);
	}
	if (AlarmMode & ALARM_WATER) {
		cnt = sizeof(str) - strlen(str);
		strncat(str, " Нет охлаждения", cnt);
	}
	if (AlarmMode & ALARM_FREQ) {
		cnt = sizeof(str) - strlen(str);
		strncat(str, "Нет напряжение сети", cnt);
	}
	if (AlarmMode & ALARM_NOLOAD) {
		cnt = sizeof(str) - strlen(str);
		strncat(str,"  Нет нагрузки", cnt);
	}
	if (AlarmMode & ALARM_EXT) {
		cnt = sizeof(str) - strlen(str);
		strncat(str,"  Сработал аварийный датчик", cnt);
	}
	strcat(str,"</b>");
	return str;
}


// Получение строки о причине перезагрузки
const char *getResetReasonStr(void)
{

	switch (resetReason) {
        case POWERON_RESET: return "Vbat power on reset";
        case SW_RESET: return "Software reset digital core";
        case OWDT_RESET: return "Legacy watch dog reset digital core";
        case DEEPSLEEP_RESET: return "Deep Sleep reset digital core";
        case SDIO_RESET: return "Reset by SLC module, reset digital core";
        case TG0WDT_SYS_RESET: return "Timer Group0 Watch dog reset digital core";
        case TG1WDT_SYS_RESET: return "Timer Group1 Watch dog reset digital core";
        case RTCWDT_SYS_RESET: return "RTC Watch dog Reset digital core";
        case INTRUSION_RESET: return "Instrusion tested to reset CPU";
        case TGWDT_CPU_RESET: return "Time Group reset CPU";
        case SW_CPU_RESET: return "Software reset CPU";
        case RTCWDT_CPU_RESET: return "RTC Watch dog Reset CPU";
        case EXT_CPU_RESET: return "For APP CPU, reseted by PRO CPU";
        case RTCWDT_BROWN_OUT_RESET: return "Reset when the vdd voltage is not stable";
        case RTCWDT_RTC_RESET: return "RTC Watch dog reset digital core and rtc module";
	default: return "Uncnown reason";
	}
}


xQueueHandle timer_queue;

static void timer_example_evt_task(void *arg)
{
	uint32_t evt;
	while(1) {
		xQueueReceive(timer_queue, &evt, portMAX_DELAY);
		for (int i=0; i<MAX_KLP; i++) {
			if (!Klp[i].is_pwm) continue;
			Klp[i].timer_sec++;

			if (Klp[i].is_open) {
				// Текущее состояние - клапан открыт
				if (Klp[i].timer_sec > Klp[i].open_time) {
					// Время открытия клапана истекло
					if (Klp[i].close_time <= 0) continue;
					ESP_LOGI(TAG, "PWM klp %d -> close", i);
					// Закрываем клапан
					valve_off(i);
				}
			} else {
				// Текущее состояние - клапан закрыт
				if (Klp[i].timer_sec > Klp[i].close_time) {
					// Пора открывать клапан
					if (Klp[i].open_time <= 0) continue;
					ESP_LOGI(TAG, "PWM klp %d -> open", i);
					// Открываем клапан
					valve_on(i);					
				}
			}
		}
	}

}
	



void IRAM_ATTR timer0_group0_isr(void *para)
{
	int timer_idx = (int) para;
	uint32_t intr_status = TIMERG0.int_st_timers.val;

	if (intr_status & BIT(timer_idx)) {

	        /*Timer will reload counter value*/
	        TIMERG0.hw_timer[timer_idx].update = 1;
		/*We don't call a API here because they are not declared with IRAM_ATTR*/
		TIMERG0.int_clr_timers.t1 = 1;
		/* For a auto-reload timer, we still need to set alarm_en bit if we want to enable alarm again.*/
		TIMERG0.hw_timer[timer_idx].config.alarm_en = 1;

		if (beepActive) {
			// Обработка пищалки
			beeperTime--;
			if (beeperTime <= 0) {
				beeperTime = 0;
				beepActive = false;
				GPIO.out_w1tc = (1 << GPIO_BEEP);
			}
		}	

		tic_counter++;
		if (tic_counter >= 1000) {
			tic_counter=0;
			uptime_counter++;
			if (rect_timer1>0) rect_timer1--; // Таймер для отсчета секунд 1
			else rect_timer1=0;
			if (timer_sec2>0) timer_sec2--;	// Таймер для отсчета секунд 2
			else timer_sec2=0;
			if (timer_sec3>0) timer_sec3--;	// Таймер для отсчета секунд 3
			else timer_sec3=0;
			CurFreq = gpio_counter;
			gpio_counter=0;
			xQueueSendFromISR(timer_queue, &intr_status, NULL);
		}

