ys1797/esp32_hd/main/hd_main.c
	}

	j = cJSON_CreateArray();
	cJSON_AddItemToObject(ja, "klapans", j);
	for (int i=0; i<MAX_KLP; i++) {
		int pwm = Klp[i].open_time+Klp[i].close_time;
		float pwm_percent = 0;
		if (Klp[i].open_time>0) {
			float p = pwm/Klp[i].open_time;
			if (p) pwm_percent = roundX(100/p,2);
		}

		jt = cJSON_CreateObject();
		cJSON_AddItemToArray(j, jt);
		cJSON_AddItemToObject(jt, "id", cJSON_CreateNumber(i));
		cJSON_AddItemToObject(jt, "is_pwm", cJSON_CreateNumber(Klp[i].is_pwm));
		cJSON_AddItemToObject(jt, "is_open", cJSON_CreateNumber(Klp[i].is_open));
		cJSON_AddItemToObject(jt, "pwm_time", cJSON_CreateNumber(pwm));
		cJSON_AddItemToObject(jt, "pwm_percent", cJSON_CreateNumber(pwm_percent));
	}

	if (MODE_RECTIFICATION == MainMode) {
		// Режим ректификации
		cJSON_AddItemToObject(ja, "rect_p_shim", cJSON_CreateNumber(ProcChimSR));
		float timeStabKolonna = fabs(getFloatParam(DEFL_PARAMS, "timeStabKolonna"));
		if (MainStatus == PROC_STAB) {
			snprintf(data, sizeof(data)-1, "%02d/%02.0f sec", uptime_counter-secTempPrev, timeStabKolonna);
			cJSON_AddItemToObject(ja, "rect_time_stab", cJSON_CreateString(data));
		}
		if (MainStatus == PROC_T_WAIT) {
			snprintf(data, sizeof(data)-1, "%02d sec", rect_timer1);
			cJSON_AddItemToObject(ja, "rect_timer1", cJSON_CreateString(data));
			snprintf(data, sizeof(data)-1, "%02.1f <-- %02.1f C", tempStabSR, getTube20Temp());
			cJSON_AddItemToObject(ja, "rect_t_stab", cJSON_CreateString(data));
		} else {
			snprintf(data, sizeof(data)-1, "%02.1f C", tempStabSR);
			cJSON_AddItemToObject(ja, "rect_t_stab", cJSON_CreateString(data));
		}
		if (bmpTruePressure > 0 && startPressure > 0) {
			double diff = startPressure - bmpTruePressure;
			snprintf(data, sizeof(data)-1, "%02.1f", diff);
			cJSON_AddItemToObject(ja, "pressureDiff", cJSON_CreateString(data));
		}

	}
	return ja;
}

// Отправка SMS
void sendSMS(char *text)
{
	request_t *req;
	int ret;
	char *post, *user, *hash, *phones;
	int s;
	if (!getIntParam(NET_PARAMS, "useSmsc")) return;

	user = getStringParam(NET_PARAMS, "smscUser");
	hash = getStringParam(NET_PARAMS, "smscHash");
	phones = getStringParam(NET_PARAMS, "smscPhones");


	if (!user || !hash || !phones) return;
	if (strlen(user)<=0 || strlen(hash)<=30 || strlen(phones)<=0) return;
	s = strlen(user) + strlen(hash) + strlen(phones) + strlen(text);
	post = malloc(s+30);
	if (!post) return;
	sprintf(post, "login=%s&psw=%s&phones=%s&mes=%s", user, hash, phones, text);

	ESP_LOGI(TAG, ">> SMS start");
	req = req_new("https://smsc.ru/sys/send.php"); 
	req_setopt(req, REQ_SET_METHOD, "POST");
	req_setopt(req, REQ_SET_POSTFIELDS, post);
	ret = req_perform(req);
	if (ret/100 > 2) {
		ESP_LOGI(TAG, "sms failed, error code: %d", ret);
	}
	req_clean(req);
	free(post);
	ESP_LOGI(TAG, "<< Sms Done");
}


// Установка рабочей мощности
void setPower(int16_t pw)
{
	int16_t mp;
	mp = getIntParam(DEFL_PARAMS, "maxPower");
	if (pw > mp) SetPower = mp;
	else SetPower = pw;

	if (pw > mp/2) {
		LEDC.channel_group[0].channel[0].duty.duty = (TRIAC_GATE_IMPULSE_CYCLES*3) << 4;
	} else {
		LEDC.channel_group[0].channel[0].duty.duty = TRIAC_GATE_IMPULSE_CYCLES << 4;
	}

	if (pw>0) setProcessGpio(1);
	else setProcessGpio(0);

	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "SetPower", SetPower);
	}
}                                                   

static void setNewProcChimSR(int16_t newValue)
{
	ProcChimSR = newValue;
	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "ProcChimSR", ProcChimSR);
	}

}

static void setTempStabSR(double newValue)
{
	uint64_t v;
	tempStabSR = newValue;
	if (nvsHandle) {
		v = (uint64_t) tempStabSR;
		ESP_ERROR_CHECK(nvs_set_u64(nvsHandle, "tempStabSR", v));
	}
}

static void setTempTube20Prev(double newValue)
{
	uint64_t v;
	tempTube20Prev = newValue;
	if (nvsHandle) {
		v = (uint64_t) tempTube20Prev;
		ESP_ERROR_CHECK(nvs_set_u64(nvsHandle, "tempTube20Prev", v));
	}

}

void setNewMainStatus(int16_t newStatus)
{
	MainStatus = newStatus;
	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "MainStatus", MainStatus);
	}
}


// Установка нового режима работы
void setMainMode(int nm)
{
	main_mode new_mode = (main_mode) nm;
	if (new_mode == MainMode) return; // Не изменился
	MainMode = new_mode;
	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "MainMode", nm);
	}

	switch (MainMode) {
	case MODE_IDLE:
		// Режим мониторинга
		ESP_LOGI(TAG, "Main mode: Idle.");
		setPower(0);
		setNewMainStatus(START_WAIT);
		break;
	case MODE_POWEERREG:
		// Режим регулятора мощности
		ESP_LOGI(TAG, "Main mode: Power reg.");
		setNewMainStatus(PROC_START);
		setPower(getIntParam(DEFL_PARAMS, "ustPowerReg"));
		break;
	case MODE_DISTIL:
		// Режим дистилляции
		ESP_LOGI(TAG, "Main mode: Distillation.");
		setNewMainStatus(START_WAIT);
		break;
	case MODE_RECTIFICATION:
		// Режим ректификации
		ESP_LOGI(TAG, "Main mode: Rectification.");
		setNewMainStatus(START_WAIT);
		break;
	case MODE_TESTKLP:
		// Режим тестирования клапанов
		ESP_LOGI(TAG, "Main mode: Test klp.");
		setNewMainStatus(START_WAIT);
		break;
	}
	myBeep(false);
}

// Ручная установка состояния конечного автомата
void setStatus(int next)
{
	if (next && MainStatus>=PROC_END) return;
	if (!next && MainStatus<= START_WAIT) return;

	switch (MainMode) {
	case MODE_DISTIL:
		// Режим дистилляции
		if (next) {
			if (MainStatus == START_WAIT) {
				setNewMainStatus(PROC_START);
			} else if (MainStatus == PROC_START) {
				startPressure = bmpTruePressure; // Фиксация атм. давления.
				setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
				setNewMainStatus(PROC_RAZGON);
			} else if (MainStatus == PROC_RAZGON) {
				openKlp(klp_water);		// Открытие клапана воды
				setPower(getIntParam(DEFL_PARAMS, "powerDistil"));	// Мощность дистилляции
				setNewMainStatus(PROC_DISTILL);
			} else if (MainStatus == PROC_DISTILL) {
				setPower(0);		// Снятие мощности с тэна
				secTempPrev = uptime_counter;
				setNewMainStatus(PROC_WAITEND);
			} else if (MainStatus == PROC_WAITEND) {
				closeAllKlp();		// Закрытие всех клапанов.
				setNewMainStatus(PROC_END);
			}
		} else {
			if (MainStatus == PROC_RAZGON) {
				setPower(0);		// Снятие мощности с тэна
				closeAllKlp();		// Закрытие всех клапанов.
				setNewMainStatus(START_WAIT);
			} else if (MainStatus == PROC_DISTILL) {
				closeAllKlp();		// Закрытие всех клапанов.
				setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
				setNewMainStatus(PROC_RAZGON);
			} else if (MainStatus == PROC_WAITEND) {
				openKlp(klp_water);		// Открытие клапана воды
				setPower(getIntParam(DEFL_PARAMS, "powerDistil"));	// Мощность дистилляции
				setNewMainStatus(PROC_DISTILL);
			} else if (MainStatus == PROC_END) {
				openKlp(klp_water);		// Открытие клапана воды
				secTempPrev = uptime_counter;
				setNewMainStatus(PROC_WAITEND);
			}
		}
		break;

