ys1797/esp32_hd/main/hd_main.c
	case MODE_RECTIFICATION:
		// Режим ректификации
		if (next) {
			if (MainStatus == START_WAIT) {
				setNewMainStatus(PROC_START);
			} else if (MainStatus == PROC_START) {
				startPressure = bmpTruePressure; // Фиксация атм. давления.
				setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
				setNewMainStatus(PROC_RAZGON);
			} else if (MainStatus == PROC_RAZGON) {
				openKlp(klp_water);	// Открытие клапана воды
				setPower(getIntParam(DEFL_PARAMS, "powerRect"));    // Устанавливаем мощность ректификации
				setNewMainStatus(PROC_STAB); // Ручной переход в режим стабилизации
			} else if (MainStatus == PROC_STAB) {
				setPower(getIntParam(DEFL_PARAMS, "powerRect"));   // Устанавливаем мощность ректификации
				secTempPrev = uptime_counter;
				closeKlp(klp_sr);	// Отключение клапана отбора товарного продукта
				// Устанавливаем медленный ШИМ клапан отбора хвостов и голов в соответвии с установками
				start_valve_PWMpercent(klp_glwhq,
					getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
					getFloatParam(DEFL_PARAMS, "procChimOtbGlv"));

				setTempStabSR(getTube20Temp() ); // температура, относительно которой будем стабилизировать отбор
				setNewMainStatus(PROC_GLV); // Ручной переход в режим отбора голов
			} else if (MainStatus == PROC_GLV) {
				setTempStabSR(getTube20Temp());	// температура, относительно которой будем стабилизировать отбор
				closeKlp(klp_glwhq);  // Отключение клапана отбора голов/хвостов
				setNewProcChimSR( getIntParam(DEFL_PARAMS, "beginProcChimOtbSR") ); // Устанавливаем стартовый % отбора товарного продукта
				setNewMainStatus(PROC_T_WAIT);
			} else if (MainStatus == PROC_T_WAIT) {
				setNewMainStatus(PROC_SR);
			} else if (MainStatus == PROC_SR) {
				closeKlp(klp_sr); // Отключение клапана продукта
				// Устанавливаем 90% медленный ШИМ клапан отбора хвостов и голов 
				start_valve_PWMpercent(klp_glwhq,
						getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
						100);

				setNewMainStatus(PROC_HV);
			} else if (MainStatus == PROC_HV) {
				setPower(0);		// Снятие мощности с тэна
				closeKlp(klp_glwhq); 	// Отключение клапана отбора голов/хвостов
				setNewMainStatus(PROC_WAITEND);
			} else if (MainStatus == PROC_WAITEND) {
				setPower(0);		// Снятие мощности с тэна
				closeAllKlp();		// Закрытие всех клапанов.
				setNewMainStatus(PROC_END);
			}
		} else {
			if (MainStatus == PROC_RAZGON) {
				// Из разгона в режим ожидания запуска 
				setPower(0);		// Снятие мощности с тэна
				closeAllKlp();		// Закрытие всех клапанов.
        			setNewMainStatus(START_WAIT);
			} else if (MainStatus == PROC_STAB) {
				// Из стабилизации в режим разгона
				setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
				setNewMainStatus(PROC_RAZGON);
			} else if (MainStatus == PROC_GLV) {
				setNewMainStatus(PROC_STAB);
			} else if (MainStatus == PROC_T_WAIT) {
				setNewMainStatus(PROC_GLV);
			} else if (MainStatus == PROC_SR) {
				setNewMainStatus(PROC_GLV);
			} else if (MainStatus == PROC_HV) {
				setNewMainStatus(PROC_SR);
			} else if (MainStatus == PROC_WAITEND) {
				// Переходим к отбору хвостов
				setPower(getIntParam(DEFL_PARAMS, "powerRect"));	// Устанавливаем мощность ректификации
				closeKlp(klp_sr);	// Отключение клапана отбора товарного продукта 
				// Устанавливаем 90% медленный ШИМ клапан отбора хвостов и голов
				start_valve_PWMpercent(klp_glwhq,
						getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
						100);

				setNewMainStatus(PROC_HV);
			} else if (MainStatus == PROC_END) {
				openKlp(klp_water);	// Открытие клапана воды
				secTempPrev = uptime_counter;
				setNewMainStatus(PROC_WAITEND);
			}
		}
		break;
	default:
		break;
	}
	if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(false);
}

/*
 * Функция возвращает значение ШИМ для отборв по "шпоре" (температуре)
 */
int16_t GetSrPWM(void)
{
	int16_t found = ProcChimSR;
	double t = getTube20Temp();

	for (int i=1; i<getIntParam(DEFL_PARAMS, "cntCHIM"); i++) {
		if (autoPWM[i-1].temp <= t && autoPWM[i].temp > t) {
			if (autoPWM[i-1].pwm > 0) {
				found = (t - autoPWM[i-1].temp) * 
					(autoPWM[i].pwm - autoPWM[i-1].pwm) / 
					(autoPWM[i].temp - autoPWM[i-1].temp) + autoPWM[i-1].pwm;
				return found;
			}
		}	
	}
	return found;
}

bool end_condition_SR(void){
	float tempEndRectOtbSR = getFloatParam(DEFL_PARAMS, "tempEndRectOtbSR");
	if (tempEndRectOtbSR>0)					// контроль по Т куба
		return (getCubeTemp() >= tempEndRectOtbSR);
	else							// контроль по Т20
		return (getTube20Temp() >= fabs(tempEndRectOtbSR) );
}

bool end_condition_head(void){
	float tEndRectOtbGlv =getFloatParam(DEFL_PARAMS, "tEndRectOtbGlv");
	if (tEndRectOtbGlv>0) 																				// если tEndRectOtbGlv положительное->это температура куба завершения отбора голов
		return  (getCubeTemp() >= tEndRectOtbGlv); 				// если Т куба достигла заданной Т окончания отбора голов
	else																											// если tEndRectOtbGlv отрицательное -> это кол-во минут времени отбора голов
		return ( (uptime_counter-secTempPrev) >= (fabs(tEndRectOtbGlv)*60) );	// время отбора голов истекло
}


// Обработка состояний в режиме ректификации
void Rectification(void)
{
	double t;
	float tempEndRectRazgon;
	char b[80];

	switch (MainStatus) {
	case START_WAIT:
		// Ожидание запуска процесса
		break;
	case PROC_START:
		// Начало процесса
		setNewMainStatus(PROC_RAZGON);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
		 /* fall through */

	case PROC_RAZGON:
		// Разгон до рабочей температуры
		tempEndRectRazgon = getFloatParam(DEFL_PARAMS, "tempEndRectRazgon");
		startPressure = bmpTruePressure; // Фиксация атм. давления.
		if (tempEndRectRazgon > 0) t = getCubeTemp();
		else t = getTube20Temp();
		if (-1 == t) break;
		if (t < fabs(tempEndRectRazgon)) break;

		// Переход в режим стабилизации колонны
		openKlp(klp_water);	// Открытие клапана воды
		setPower(getIntParam(DEFL_PARAMS, "powerRect"));	// Устанавливаем мощность ректификации
		// Запоминаем температуру и время
		t = getTube20Temp();
                setTempStabSR(t);
		setTempTube20Prev(t);
		secTempPrev = uptime_counter;
		setNewMainStatus(PROC_STAB);
#ifdef DEBUG
		ESP_LOGI(TAG, "Switch state to stabilization.");
#endif
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		 /* fall through */

