ys1797/esp32_hd/main/hd_main.c
	case PROC_STAB:
		{
		// Стабилизация колонны
		t = getTube20Temp();
		if (-1 == t) {
			ESP_LOGE(TAG, "Can't get cube or 20%% tube temperature!!");
			break;
		}

		if (t < 70) {
			// Колонна еще не прогрелась.
#ifdef DEBUG
			ESP_LOGI(TAG, "Cube or 20%% tube temperature less 70 dg.");
#endif
			break;
		}
		float timeStabKolonna = getFloatParam(DEFL_PARAMS, "timeStabKolonna");
		if (timeStabKolonna > 0) {
			// Время относительно последнего изменения температуры
			if (fabs(t - tempTube20Prev) < 0.2) {
				// Если текущая температура колонны равна температуре,
				// запомненной ранее в пределах погрешности в 0.2 градуса C
#ifdef DEBUG
				ESP_LOGI(TAG, "Stabillization %d of %02.0f sec.", uptime_counter-secTempPrev, fabs(timeStabKolonna));
#endif

				if (uptime_counter-secTempPrev<timeStabKolonna) {
					// С момента последнего измерения прошло меньше заданого
					// времени.
					break;
				}
				// Если с момента последнего измерения прошло больше
				// cекунд чем нужно, считаем, что температура в колонне
				// стабилизировалась и переходим к отбору голов
			} else {
#ifdef DEBUG
				ESP_LOGI(TAG, "Stab. temp. changed from %0.2f to %0.2f. Reseting timer.", tempTube20Prev, t);
#endif

				// Рассогласование температуры запоминаем
				// температуру и время
		                setTempStabSR(t);
				setTempTube20Prev(t);
				secTempPrev = uptime_counter;
				break;
			}
		} else {
			// Абсолютное значение времени
#ifdef DEBUG
			ESP_LOGI(TAG, "Stabillization %d of %0.0f.", uptime_counter-secTempPrev, fabs(timeStabKolonna));
#endif
			if (uptime_counter-secTempPrev < fabs(timeStabKolonna)) {
				// Если с момента начала стабилизации прошло меньше
				// заданного количества секунд - продолжаем ждать
				break;
			}
		}

		// Переходим к следующему этапу - отбору голов.
		setNewMainStatus(PROC_GLV);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		secTempPrev = uptime_counter;
		setPower(getIntParam(DEFL_PARAMS, "powerRect"));	// Устанавливаем мощность ректификации
		closeKlp(klp_sr);	// Отключение клапана отбора товарного продукта 
		// Устанавливаем медленный ШИМ клапан отбора хвостов и голов в соответвии с установками
		start_valve_PWMpercent(klp_glwhq,
			getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
			getFloatParam(DEFL_PARAMS, "procChimOtbGlv"));

		setTempStabSR(getTube20Temp());	// температура, относительно которой будем стабилизировать отбор
#ifdef DEBUG
		ESP_LOGI(TAG, "Switch to `glv` stage");
#endif

		}
		 /* fall through */

	case PROC_GLV:
		// Отбор головных фракций
		//  проверим: не пора ли завершать отбор голов?
		if (!end_condition_head())	break;
		// Окончание отбора голов
		closeKlp(klp_glwhq); 			// Отключение клапана отбора голов/хвостов
		setNewMainStatus(PROC_T_WAIT);		// Переходим к стабилизации температуры
		setNewProcChimSR(getIntParam(DEFL_PARAMS, "beginProcChimOtbSR")); // Устанавливаем стартовый % отбора товарного продукта
		setTempStabSR(getTube20Temp()); // температура, относительно которой будем стабилизировать отбор
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
#ifdef DEBUG
		ESP_LOGI(TAG, "Switch to `T wait` stage");
#endif
		 /* fall through */

	case PROC_T_WAIT:
		// Ожидание стабилизации температуры
		if (tempStabSR <= 0) setTempStabSR(28.5);

		if (0 == rect_timer1 && getIntParam(DEFL_PARAMS, "timeRestabKolonna") > 0) {
			// Если колонна слишком долго находится в режиме стопа,
			// то температуру стабилизации примем за новую
			setTempStabSR(getTube20Temp());
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
#ifdef DEBUG
			ESP_LOGI(TAG, "New temperature for stabilization: %0.2f", tempStabSR);
#endif

		}

		//---проверим: не пора ли завершить тело и перейти к хвостам?
		if (end_condition_SR())	{
			// Переходим к отбору хвостов
			closeKlp(klp_sr);	// Отключение клапана отбора товарного продукта
			// Устанавливаем ШИМ клапан отбора хвостов и голов
			start_valve_PWMpercent(klp_glwhq,
					getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
					100); // хвост отбираем на все 100 !
       			setNewMainStatus(PROC_HV);
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
			break;
		}
		
		if (getTube20Temp() > tempStabSR) {
			break;
		}

		// Переход к отбору товарного продукта

		// Реализуется отбор по-шпоре, что в функции прописано то и будет возвращено.
		setNewProcChimSR(GetSrPWM());
		closeKlp(klp_glwhq); // Отключение клапана отбора голов/хвостов 
		// Устанавливаем медленный ШИМ клапана продукта
		start_valve_PWMpercent
		  ( klp_sr, // клапан продукта
			getFloatParam(DEFL_PARAMS, "timeChimRectOtbSR"),// период ШИМ в сек
			ProcChimSR //%
		  );

		secTempPrev = uptime_counter;	// Запомним время, когда стабилизировалась температура
		setNewMainStatus(PROC_SR);	// Переход к отбору продукта
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
#ifdef DEBUG
		ESP_LOGI(TAG, "Switch state to SR. Temperature: %0.2f", tempStabSR);
#endif
                 /* fall through */

	case PROC_SR:
		// Отбор СР
		t = getTube20Temp();

		int minProcChimOtbSR = getIntParam(DEFL_PARAMS, "minProcChimOtbSR");

		if (t < tempStabSR) {	//если температура стала ниже Т стабилизации, то принимаем ее за новую Т стабилизации (ПБ)
			setTempStabSR(t);
		}

		if (t >= tempStabSR + getFloatParam(DEFL_PARAMS, "tempDeltaRect")) {
			// Температура превысила температуру стабилизации
			closeKlp(klp_sr); // Отключение клапана продукта
			int cntCHIM = getIntParam(DEFL_PARAMS, "cntCHIM");

			if (cntCHIM < 0) {
				// Запоминаем температуру, когда произошел стоп за вычетом 0.1 градуса.
				autoPWM[-cntCHIM].temp = t - 0.1;
				autoPWM[-cntCHIM].pwm = ProcChimSR;
				if (-cntCHIM < COUNT_PWM-1) cntCHIM--;
			}
			int decrementCHIM = getIntParam(DEFL_PARAMS, "decrementCHIM");
			if (decrementCHIM>=0) { 
				// Тогда уменьшаем  ШИМ указанное число процентов в абсолютном выражении
				setNewProcChimSR(ProcChimSR-decrementCHIM);
			} else {
				uint16_t v = (ProcChimSR * (-decrementCHIM))/100;
				// Процентное отношение может быть очень мало,
				// поэтому если получилось нулевое значение, то вычтем единицу.
				if (v<=0) v=1;
				setNewProcChimSR(ProcChimSR - v); // Тогда увеличиваем ШИМ на число процентов в относительном выражении
			}
			if (ProcChimSR < minProcChimOtbSR) setNewProcChimSR(minProcChimOtbSR);
			rect_timer1 = getIntParam(DEFL_PARAMS, "timeRestabKolonna"); // Установка таймера стабилизации
			setNewMainStatus(PROC_T_WAIT); // Переходим в режим стабилизации
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
#ifdef DEBUG
			ESP_LOGI(TAG, "Switch state to temperature re-stabilization.");
#endif
			break;
		} else {
			int timeAutoIncCHIM = getIntParam(DEFL_PARAMS, "timeAutoIncCHIM");
        		if (timeAutoIncCHIM>0 && (uptime_counter - secTempPrev) > timeAutoIncCHIM) {
				// Если температура не выросла более, чем за 10 минут, прибавим ШИМ на 5%
				if (ProcChimSR > minProcChimOtbSR) {
					// Шим прибавляем только если не дошли до минимального
					int incrementCHIM = getIntParam(DEFL_PARAMS, "incrementCHIM");
					if (incrementCHIM>=0) {
						// Абсолютное значение
						setNewProcChimSR(ProcChimSR + incrementCHIM);
					} else {
						// Проценты
						setNewProcChimSR(ProcChimSR + (ProcChimSR*(-incrementCHIM))/100);
					}
					if (ProcChimSR>95) setNewProcChimSR(95);
					// Устанавливаем 90% медленный ШИМ клапан отбора хвостов и голов
					start_valve_PWMpercent
					  ( klp_sr, // клапан продукта
						getFloatParam(DEFL_PARAMS, "timeChimRectOtbSR"),// период ШИМ в сек
						ProcChimSR //%
					  );

