ys1797/esp32_hd/main/hd_main.c
				}
				secTempPrev = uptime_counter;
			}
		}

		// проверим - можно ли продолжать отбор тела?
		if (! end_condition_SR())	{
			break;  // продолжаем отбор тела
		}

		// Температура в кубе превысила температуру при которой надо отбирать СР
		closeKlp(klp_sr); 			// Отключение клапана продукта
			start_valve_PWMpercent(klp_glwhq,
					getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
					100);
		setNewMainStatus(PROC_HV);			// Переход к отбору хвостов
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		 /* fall through */

	case PROC_HV:
		// Отбор хвостовых фракций
		t = getCubeTemp();
		if (t < getFloatParam(DEFL_PARAMS, "tempEndRect")) {
			break;
		}
		// Температура достигла отметки окончания ректификации
		// Переход к окончанию процесса
		setPower(0);		// Снятие мощности с тэна
		closeKlp(klp_glwhq); 	// Отключение клапана отбора голов/хвостов
		secTempPrev = uptime_counter;
		setNewMainStatus(PROC_WAITEND);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
#ifdef DEBUG
		ESP_LOGI(TAG, "Switch state to wait End of Rectification.");
#endif
		 /* fall through */

	case PROC_WAITEND:
		// Отключение нагрева, подача воды для охлаждения
		if (uptime_counter - secTempPrev > 180) {
			setPower(0);		// Снятие мощности с тэна
			closeAllKlp();		// Закрытие всех клапанов.
			SecondsEnd = uptime_counter;
			sprintf(b, "Rectification complete, time: %02d:%02d:%02d", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60);
			sendSMS(b);
        		setNewMainStatus(PROC_END);
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
#ifdef DEBUG
			ESP_LOGI(TAG, "%s", b);
#endif
		}
		break;

	case PROC_END:
		// Окончание работы
		break;
	}
}

// Обработка состояний в режиме дистилляции
void Distillation(void)
{
	double t;
	char b[80];

	switch (MainStatus) {
	case START_WAIT:
		// Ожидание запуска процесса
		break;
	case PROC_START:
		// Начало процесса
		startPressure = bmpTruePressure; // Фиксация атм. давления.
		setNewMainStatus(PROC_RAZGON);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		setPower(getIntParam(DEFL_PARAMS, "maxPower"));	//  максимальная мощность для разгона
		 /* fall through */

	case PROC_RAZGON:
		// Разгон до рабочей температуры
		t = getCubeTemp();
		if (-1 == t) break;
		if (t < getFloatParam(DEFL_PARAMS, "tempEndRectRazgon")) break;

		// Открытие клапана воды
		openKlp(klp_water);

		setNewMainStatus(PROC_DISTILL);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		setPower(getIntParam(DEFL_PARAMS, "powerDistil"));	// Мощность дистилляции
		 /* fall through */

	case PROC_DISTILL:
		// Процесс дистилляции
		t = getCubeTemp();
		if (t < getFloatParam(DEFL_PARAMS, "tempEndDistil")) {
			break;
		}

		secTempPrev = uptime_counter;
		setNewMainStatus(PROC_WAITEND);			// Переход к окончанию процесса
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		 /* fall through */

	case PROC_WAITEND:
		// Отключение нагрева, подача воды для охлаждения
		setPower(0);		// Снятие мощности с тэна
		if (uptime_counter - secTempPrev > 180) {
			setNewMainStatus(PROC_END);
			SecondsEnd = uptime_counter;
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		}
		break;

	case PROC_END:
		// Окончание работы
		setPower(0);		// Снятие мощности с тэна
		closeAllKlp();		// Закрытие всех клапанов.
		sprintf(b, "Distillation complete, time: %02d:%02d:%02d", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60);
		sendSMS(b);
		break;
	}
}

/*
 * выключение клапана без сброса �Ш�М
 * @param valve_num - номер клапана
 */
void valve_off(int valve_num){
	if (valve_num>=MAX_KLP) {
		ESP_LOGE("valve_OFF", "incorrect valve num %d", valve_num);
		return;
	}
	ledc_channel_t ch = Klp[valve_num].channel;
	ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, 0);
	ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
	LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 0;
	Klp[valve_num].is_open = false;
	Klp[valve_num].timer_sec = 0;
	//ESP_LOGI(TAG, "valve %d OFF", valve_num);
}



/*
 * Закрытие всех клапанов.
 */
void closeAllKlp(void)
{
	for (int i=0; i<MAX_KLP; i++)	closeKlp(i);
}

/*
 * задача включения клапана, номер клапана в аргументе *arg как *int
 * Самоудаляется после отработки
 * Включает клапан
 * -для снижения тока и нагрева клапана:
 * после включения и выдерживания паузы на механическое включение
 * ток клапана снижается переводом на %PWM
 *
 * @*arg - *int номера клапана (!!! д.быть static !!!)
 */
static void valve_open_task(void *arg){
	int valve_num=*(int*)arg;
	if (valve_num >=MAX_KLP)
		vTaskDelete(NULL);

	ledc_channel_t ch = Klp[valve_num].channel;
	LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 1;
	if (getIntParam(DEFL_PARAMS,"klpSilentNode")) {
		ledc_set_fade_with_time(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY, VALVE_ON_FADE_TIME_MS);
		ledc_fade_start(LEDC_HIGH_SPEED_MODE, ch, LEDC_FADE_NO_WAIT);
		vTaskDelay(VALVE_ON_FADE_TIME_MS/portTICK_PERIOD_MS);
	} else {
		ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY);
		ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
	}
#define KEEP_KLP_PWM 30  // процент ШИМ удержания 
#define KEEP_KLP_DELAY_MS 150  // задержка перевода в ШИМ удержания после включения, мс 
	//ESP_LOGI("keep_valve", "valve %d prc:%d delay:%d", valve_num,getIntDEFparam("vlvKeepPWM"),getIntDEFparam("vlvDelayLowPWM"));
	// ждем пока механика клапана включится 
	vTaskDelay(KEEP_KLP_DELAY_MS/portTICK_PERIOD_MS);
	// снижаем ток
	ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, ((VALVE_DUTY*KEEP_KLP_PWM))/100ul);
	ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
	vTaskDelete(NULL);
}


/*
 * Открытие клапана
 * @param valve_num - номер клапана
 */
void valve_on(int valve_num){
	if (valve_num>=MAX_KLP) return;
static int num;
	num=valve_num;
	//---запускаем задачу открытия клапана 
	xTaskCreate(valve_open_task, "valve_open", 4096, (void *)&num, 5, NULL);
	Klp[valve_num].is_open = true;
	Klp[valve_num].timer_sec = 0;
	//ESP_LOGI(TAG, "valve %d ON", valve_num);
}


/*
 * Открытие клапана воды
 */
void openKlp(int i)
{
	valve_on(i);
	Klp[i].is_pwm = false;
}

